import 'package:tadamon/features/pages/help_user_page/data/model/qna_model.dart';

class QnaRepositore {
  static Future<List<QnaModel>> getQna() async {
    return [
  const QnaModel("كيف أستخدم التطبيق؟", "قم بإنشاء حساب وابدأ.", 
          "يمكنك البدء بإنشاء حساب عبر إدخال بياناتك الشخصية، ثم تسجيل الدخول للوصول إلى جميع ميزات التطبيق مثل البحث والتبرع."),
      
      const QnaModel("كيف أعيد تعيين كلمة المرور؟", "من الإعدادات > إعادة تعيين كلمة المرور.", 
          "انتقل إلى الإعدادات، ثم اضغط على 'إعادة تعيين كلمة المرور'، وأدخل بريدك الإلكتروني لاستلام رابط إعادة التعيين."),
      
      const QnaModel("ما هو هدف التطبيق؟", "تسهيل الوصول إلى مراكز التبرع.", 
          "التطبيق يساعد المستخدمين في العثور على أقرب مراكز التبرع، ويوفر معلومات حول التبرعات المتاحة وكيفية المساهمة."),
      
      const QnaModel("كيف أبحث عن منتج معين؟", "استخدم شريط البحث.", 
          "اكتب اسم المنتج في شريط البحث، وسيعرض التطبيق جميع النتائج المطابقة من المتاجر أو مراكز التبرع."),
      
      const QnaModel("كيف يمكنني تصفية نتائج البحث؟", "اختر الفئات المناسبة.", 
          "عند البحث عن منتج، يمكنك تضييق النتائج عبر اختيار فئات محددة مثل الموقع، النوع، أو السعر."),
      
      const QnaModel("كيف أرتب نتائج البحث؟", "حدد طريقة الفرز.", 
          "يمكنك ترتيب النتائج وفقًا للسعر، الأحدث، أو التقييم للحصول على أفضل النتائج وفقًا لاحتياجاتك."),
      
      const QnaModel("كيف أغير لغة التطبيق؟", "من الإعدادات > تغيير اللغة.", 
          "انتقل إلى الإعدادات، ثم اختر اللغة المفضلة لك وسيتم تطبيق التغييرات مباشرة."),
      
      const QnaModel("كيف أتواصل مع دعم العملاء؟", "عبر البريد الإلكتروني.", 
          "لأي استفسارات أو مشاكل، يمكنك التواصل مع دعم العملاء عبر البريد الإلكتروني [support@tadamon.com](mailto:support@tadamon.com)."),
      
      const QnaModel("كيف أساهم في التبرعات؟", "حدد خيار التبرع من القائمة.", 
          "يمكنك تصفح قسم التبرعات، ثم اختيار نوع التبرع الذي تريد تقديمه، وإدخال التفاصيل المطلوبة."),
      
      const QnaModel("هل التطبيق مجاني؟", "نعم، التطبيق مجاني بالكامل.", 
          "يمكنك استخدام جميع الميزات مجانًا، ولكن قد يكون هناك بعض الخدمات المدفوعة في المستقبل لدعم عمليات التبرع."),
      
      const QnaModel("هل يمكنني حذف حسابي؟", "نعم، من خلال الإعدادات.", 
          "انتقل إلى الإعدادات، ثم اضغط على 'حذف الحساب' واتبع التعليمات لتأكيد العملية."),
      
      const QnaModel("كيف أبلغ عن مشكلة؟", "من خلال الدعم الفني.", 
          "إذا واجهت مشكلة، يمكنك الإبلاغ عنها عبر قسم 'الدعم' داخل التطبيق أو إرسال تفاصيل المشكلة عبر البريد الإلكتروني."),
      
      const QnaModel("هل التطبيق متاح على جميع الأجهزة؟", "نعم، على أندرويد و iOS.", 
          "يمكنك تحميل التطبيق من متجر Google Play لأجهزة أندرويد، ومن App Store لأجهزة iOS."),    ];
  }
}