Repository: MostafaSensei106/Tadamon-App106
Catalog: lib/l10n/intl_*.arb
Languages: ar

# AppName
source: Tadamon
ar: تضامن

# AppDescription
source: Supporting Palestine is a humanitarian duty. Boycotting companies supporting the occupation is a voice for freedom.
ar: دعم فلسطين واجب إنساني. مقاطعة الشركات الداعمة للاحتلال هي صوت الحرية.

source: Home
ar: الرئيسية

source: Search
ar: بحث

source: Logs
ar: السجلات

source: Scan Barcode
ar: فحص الباركود

source: Image Analysis
ar: تحليل الصور

source: Edit Text
ar: تعديل النص

# PalatineMap
source: Palestine Map
ar: خريطة فلسطين

# Donate
source: Donate for Gaza
ar: تبرع لغزة

# scanedProducts
source: Reviewed Products
ar: المنتجات التي تمت مراجعتها

source: Supported Products
ar: المنتجات المدعومة

# SystemTheme
source: App Theme Color
ar: لون واجهة التطبيق

# FollowSystemTheme
source: Match System Theme
ar: مطابقة لون النظام

# DarkTheme
source: Dark Mode
ar: الوضع الداكن

# LightTheme
source: Light Mode
ar: الوضع الفاتح

# SwitchToDarkTheme
source: Switch to Dark Mode
ar: التبديل إلى الوضع الداكن

# SwitchToLightTheme
source: Switch to Light Mode
ar: التبديل إلى الوضع الفاتح

# EnableOnline
source: Download Product List
ar: تحميل قائمة المنتجات

# EnableOnlineMassage
source: Run the app without internet.
ar: تشغيل التطبيق بدون إنترنت.

source: Clear Logs
ar: حذف السجلات

# clearLogsMassage
source: Erase product logs in the app.
ar: مسح سجلات المنتجات في التطبيق.

# HowToUse
source: FAQ
ar: الأسئلة الشائعة

# HowToUseMassage
source: Learn how to use the app.
ar: تعرف على طريقة استخدام التطبيق.

source: Report Product
ar: الإبلاغ عن منتج

# ReportProductMassage
source: Help us improve the app.
ar: ساعدنا في تحسين التطبيق.

source: Test
ar: تجريبي

# SheetTitleProductInfo
source: Product Details
ar: تفاصيل المنتج

source: Developer
ar: المطور

# ReadMeMassage
source: App repository on GitHub.
ar: رابط إلى مستودع التطبيق على جيت هاب.

# LetastUpdate
source: Latest Updates
ar: آخر التحديثات

# LetestUpdateMassage
source: Check updates and changelog.
ar: اطلع على التحديثات وسجل التغييرات.

# GithubTiket
source: GitHub Ticket
ar: تذكرة على جيت هاب

# GithubTiketMassage
source: Report an issue or suggest a new feature.
ar: الإبلاغ عن خطأ أو اقتراح ميزة جديدة.

source: Telegram Channel
ar: قناة تلغرام

# TelegramChannelMassage
source: Link to Telegram channel.
ar: رابط إلى قناة تلغرام.

# About
source: About the App
ar: معلومات عن التطبيق

# AboutTadamon
source: About Tadamon App.
ar: حول تطبيق تضامن.

# ContactDev
source: Message from Developer
ar: رسالة من المطور

# DevMassage
source: No message available.
ar: لا توجد رسالة حالياً.

# DevThx
source: Thank you for using Tadamon.
ar: شكراً لاستخدام تطبيق تضامن.

# DevDonate
source: Support the Developer.
ar: ادعم المطور.

# ContactDevMassage
source: Follow me on social media.
ar: تابعني على مواقع التواصل الاجتماعي.

source: Close
ar: إغلاق
